<?php

namespace App\Console\Commands;

use App\Entity\Geo\Country\Country;
use Illuminate\Console\Command;
use GeoNames\Client as GeoNamesClient;
use Illuminate\Support\Str;
use function PHPSTORM_META\type;
use VK\Client\Enums\VKLanguage;
use VK\Client\VKApiClient;

class FillCountries extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'countries:fill';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    /** @var array */
    protected $countries;

    /**
     * Create a new command instance.
     *
     * @return void
     */
    public function __construct()
    {
        parent::__construct();
        $this->initMaps();
    }

    /**
     * Execute the console command.
     *
     * @return mixed
     */
    public function handle()
    {
        $token = '4c3f00984c3f00984c3f0098ab4c60b0c344c3f4c3f0098162819c8fcc5a2e49fe7c2b0';
        $vk = new VKApiClient('5.95', VKLanguage::ENGLISH);
        $vk_ru = new VKApiClient('5.95', VKLanguage::RUSSIAN);

        $countries_english = $vk->database()->getCountries($token, [
            'count' => 300,
            'need_all' => 1
        ])['items'];

        foreach ($countries_english as $country) {
            $country_slug = strtolower(str_replace(' ', '-', $country['title']));
            $result = preg_match('/^[a-zA-Z-]*$/', $country_slug, $matches);
            // если строка не состоит только из символов английского алфавита
            if (!$result) {
                $country_slug = Str::slug($country_slug, '-');
            }
            $country_ru = $vk_ru->database()->getCountriesById($token, [
                'country_ids' => $country['id'],
            ])[0];

            $code = null;
            if(isset($this->countries[$country_ru['title']])) {
                $code = strtolower($this->countries[$country_ru['title']]);
            }

            $created_country = Country::where('slug', $country_slug)->first();

            if(!$created_country) {
                $created_country = Country::create([
                    'slug' => $country_slug,
                    'code' => $code,
                    'ru' => ['name' => $country_ru['title']],
                    'en' => ['name' => $country['title']],
                ]);
            } else {
                $created_country->update([
                    'code' => $code,
                    'ru' => ['name' => $country_ru['title']],
                    'en' => ['name' => $country['title']],
                ]);
            }

            $cities_english = $vk->database()->getCities($token, [
                'country_id' => $country['id'],
            ])['items'];

            foreach ($cities_english as $city) {
                $city_ru = $vk_ru->database()->getCitiesById($token, [
                    'city_ids' => $city['id'],
                ])[0];


                $city_slug = strtolower(str_replace(' ', '-', $city['title']));
                $result = preg_match('/^[a-zA-Z-]*$/', $city_slug, $matches);
                // если строка не состоит только из символов английского алфавита
                if (!$result) {
                    $city_slug = Str::slug($city_slug, '-');
                }

                try {
                    // добавляем город в страну
                    $created_country->cities()->create([
                        'slug' => $city_slug,
                        'en' => ['name' => $city['title']],
                        'ru' => ['name' => $city_ru['title']]
                    ]);
                } catch (\Exception $e) {
                    continue;
                }
            }
        }
    }

    public function initMaps() {
        $countries_json = '{"Острова Теркс и Кайкос":"TC","Тайвань":"TW","Бонайре, Синт-Эстатиус и Саба":"SABA","Кюрасао":"CW","Гернси":"GG","Джерси":"JE","Остров Мэн":"IM","Синт-Мартен":"SX","Австралия":"AU","Австрия":"AT","Азербайджан":"AZ","Аландские острова":"AX","Албания":"AL","Алжир":"DZ","Внешние малые острова (США)":"UM","Американские Виргинские острова":"VI","Виргинские острова, США":"VI","Американское Самоа":"AS","Ангилья":"AI","Ангола":"AO","Андорра":"AD","Антарктида":"AQ","Антигуа и Барбуда":"AG","Аргентина":"AR","Армения":"AM","Аруба":"AW","Афганистан":"AF","Багамы":"BS","Бангладеш":"BD","Барбадос":"BB","Бахрейн":"BH","Белиз":"BZ","Белоруссия":"BY","Беларусь":"BY","Бельгия":"BE","Бенин":"BJ","Бермуды":"BM","Болгария":"BG","Боливия":"BO","Босния и Герцеговина":"BA","Ботсвана":"BW","Бразилия":"BR","Британская территория в Индийском океане":"IO","Виргинские острова, Великобритания":"VG","Бруней":"BN","Буркина-Фасо":"BF","Бурунди":"BI","Бутан":"BT","Вануату":"VU","Ватикан":"VA","Великобритания":"GB","Венгрия":"HU","Венесуэла":"VE","Восточный Тимор":"TL","Вьетнам":"VN","Габон":"GA","Гаити":"HT","Гайана":"GY","Гамбия":"GM","Гана":"GH","Гваделупа":"GP","Гватемала":"GT","Гвинея":"GN","Гвинея-Бисау":"GW","Германия":"DE","Гибралтар":"GI","Гондурас":"HN","Гонконг":"HK","Гренада":"GD","Гренландия":"GL","Греция":"GR","Грузия":"GE","Гуам":"GU","Дания":"DK","Конго":"CD","Конго, демократическая республика":"CD","Джибути":"DJ","Доминика":"DM","Доминиканская Республика":"DO","Европейский союз":"EU","Египет":"EG","Замбия":"ZM","Западная Сахара":"EH","Зимбабве":"ZW","Израиль":"IL","Индия":"IN","Индонезия":"ID","Иордания":"JO","Ирак":"IQ","Иран":"IR","Ирландия":"IE","Исландия":"IS","Испания":"ES","Италия":"IT","Йемен":"YE","Северная Корея":"KP","Кабо-Верде":"CV","Казахстан":"KZ","Острова Кайман":"KY","Камбоджа":"KH","Камерун":"CM","Канада":"CA","Катар":"QA","Кения":"KE","Кипр":"CY","Кыргызстан":"KG","Кирибати":"KI","Китай":"CN","Кокосовые острова":"CC","Колумбия":"CO","Коморы":"KM","Коста-Рика":"CR","Кот-д\'Ивуар":"CI","Куба":"CU","Кувейт":"KW","Лаос":"LA","Латвия":"LV","Лесото":"LS","Либерия":"LR","Ливан":"LB","Ливия":"LY","Литва":"LT","Лихтенштейн":"LI","Люксембург":"LU","Маврикий":"MU","Мавритания":"MR","Мадагаскар":"MG","Майотта":"YT","Макао":"MO","Северная Македония":"MK","Малави":"MW","Малайзия":"MY","Мали":"ML","Мальдивы":"MV","Мальта":"MT","Марокко":"MA","Мартиника":"MQ","Маршалловы Острова":"MH","Мексика":"MX","Мозамбик":"MZ","Молдова":"MD","Монако":"MC","Монголия":"MN","Монтсеррат":"MS","Мьянма":"MM","Намибия":"NA","Науру":"NR","Непал":"NP","Нигер":"NE","Нигерия":"NG","Нидерландские Антильские острова":"AN","Нидерланды":"NL","Никарагуа":"NI","Ниуэ":"NU","Новая Каледония":"NC","Новая Зеландия":"NZ","Норвегия":"NO","ОАЭ":"AE","Объединенные Арабские Эмираты":"AE","Оман":"OM","Остров Рождества":"CX","Острова Кука":"CK","Херд и Макдональд":"HM","Пакистан":"PK","Палау":"PW","Палестинская автономия":"PS","Панама":"PA","Папуа — Новая Гвинея":"PG","Парагвай":"PY","Перу":"PE","Питкерн":"PN","Польша":"PL","Португалия":"PT","Пуэрто-Рико":"PR","Республика Конго":"CG","Реюньон":"RE","Россия":"RU","Руанда":"RW","Румыния":"RO","США":"US","Сальвадор":"SV","Самоа":"WS","Сан-Марино":"SM","Сан-Томе и Принсипи":"ST","Саудовская Аравия":"SA","Свазиленд":"SZ","Шпицберген и Ян-Майен":"SJ","Шпицберген и Ян Майен":"SJ","Северные Марианские острова":"MP","Сейшелы":"SC","Сенегал":"SN","Сент-Винсент и Гренадины":"VC","Сент-Китс и Невис":"KN","Сент-Люсия":"LC","Сент-Пьер и Микелон":"PM","Сербия":"RS","Сербия и Черногория (действовал до сентября 2006 года)":"CS","Сингапур":"SG","Сирия":"SY","Словакия":"SK","Словения":"SI","Соломоновы Острова":"SB","Сомали":"SO","Южный Судан":"SD","Судан":"SD","Суринам":"SR","Сьерра-Леоне":"SL","СССР (действовал до сентября 1992 года)":"SU","Таджикистан":"TJ","Таиланд":"TH","Китайская Республика":"TW","Танзания":"TZ","Того":"TG","Токелау":"TK","Тонга":"TO","Тринидад и Тобаго":"TT","Тувалу":"TV","Тунис":"TN","Туркмения":"TM","Туркменистан":"TM","Турция":"TR","Уганда":"UG","Узбекистан":"UZ","Украина":"UA","Уругвай":"UY","Фарерские острова":"FO","Микронезия, федеративные штаты":"FM","Фиджи":"FJ","Филиппины":"PH","Финляндия":"FI","Фолклендские острова":"FK","Франция":"FR","Французская Гвиана":"GF","Французская Полинезия":"PF","Французские Южные и Антарктические Территории":"TF","Хорватия":"HR","Центральноафриканская Республика":"CF","Чад":"TD","Черногория":"ME","Чехия":"CZ","Чили":"CL","Швейцария":"CH","Швеция":"SE","Шри-Ланка":"LK","Эквадор":"EC","Экваториальная Гвинея":"GQ","Эритрея":"ER","Эстония":"EE","Эфиопия":"ET","ЮАР":"ZA","Южно-Африканская Республика":"ZA","Южная Корея":"KR","Южная Георгия и Южные Сандвичевы острова":"GS","Ямайка":"JM","Япония":"JP","Остров Буве":"BV","Остров Норфолк":"NF","Остров Святой Елены":"SH","Святая Елена":"SH","Острова Тёркс и Кайкос":"TC","Уоллис и Футуна":"WF"}';
        $this->countries = json_decode($countries_json, true);
    }
}
